public class Task {
    //home work 5
    /*Создайте класс Person, с полями ИЗ ЗАДАЧИ 13,04,2021
     Практическая часть (-id, age, salary, passport, address, dateOfBirthday, dateTimeCreate, timeToLunch, letter).
      Сгенерируйте группу из 100 человек в возрасте от 15 до 30.
            1) выберете объекты, возраст которых меньше 21;
2) распечатать их на экран;
3) сортируем по фамилии, а потом по имени (использовать thenComparing у объекта Comparator);
4) убираем дубли (если name, surname, age одинаковые)
5) сохраняем в файл, как объект, каждый экземпляр класса Person
6) читаем из файла
7) создаем при помощи потока новую коллекцию (List<String>) только из Фамилии и Имени для прочтенных из фалов объектов
8) выводим на экран
9) для вывода на экран используем (ResourceBundle)
10) СОХРАНИТЬ В БАЗУ ДАННЫХ каждый экземпляр класса Person
11) ПРОЧЕСТЬ ИЗ БАЗЫ ДАННЫХ экземпляры класса Person и повторить пункты 7, 8, 9*/
}
